tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# --------------------------------------

brew 'bash'
brew 'coreutils'
brew 'findutils'
brew 'rsync'
brew 'tree'
brew 'wget'

brew 'git'
brew 'node'
brew 'npm'
brew 'nvm'
brew 'yarn'
brew 'jq'

brew 'mysql'
brew 'python'
brew 'ruby'

# --------------------------------------

cask_args appdir: '/Applications'

cask 'google-chrome'
cask 'firefox'

cask 'sublime-text'
cask 'visual-studio-code'
cask 'atom'

cask 'iterm2'
cask 'sequel-pro'
cask 'sourcetree'

cask '1password'
cask 'alfred'
cask 'bartender'
cask 'dash'
cask 'flux'
cask 'slack'
cask 'dropbox'
cask 'the-unarchiver'

cask 'handbrake'
cask 'vlc'

# Quick Look plugins
# https://github.com/sindresorhus/quick-look-plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlmobi'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
# https://github.com/caskroom/homebrew-fonts
cask 'font-bebas-neue'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ubuntu'
